test/performance/benchmarks/func-invocation-ego/run/single-fun-enclave-no-samba-sacmat/1000.log
2025/10/20 02:35:35 Function mode: 
2025/10/20 02:35:35 RSA_SK is not set, not encrypting using RSA private key
{"level":"info","ts":1760927735.2683632,"logger":"fallback","caller":"injection/injection.go:63","msg":"Starting informers..."}
2025/10/20 02:35:35 Starting func invocation probe for target: appender-ego
2025/10/20 02:35:35 Using rate: 1000
Requests      [total, rate, throughput]         299996, 1000.00, 999.98
Duration      [total, attack, wait]             5m0s, 5m0s, 8.512ms
2025/10/20 02:41:35 Shutting down InfluxReporter
Latencies     [min, mean, 50, 90, 95, 99, max]  1.208ms, 5.731ms, 5.444ms, 7.081ms, 7.7ms, 11.007ms, 210.193ms
Bytes In      [total, mean]                     11399848, 38.00
Bytes Out     [total, mean]                     6899908, 23.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:299996  
Error Set:
2025/10/20 02:41:35 SLA 1 failed. P95 latency is not in 100000000-110000000ms time range: 7.700497ms