test/performance/benchmarks/func-invocation-ego/run/single-fun-enclave-no-samba-sacmat/1250.log
2025/10/20 02:41:58 Function mode: 
2025/10/20 02:41:58 RSA_SK is not set, not encrypting using RSA private key
{"level":"info","ts":1760928118.268557,"logger":"fallback","caller":"injection/injection.go:63","msg":"Starting informers..."}
2025/10/20 02:41:58 Starting func invocation probe for target: appender-ego
2025/10/20 02:41:58 Using rate: 1250
2025/10/20 02:47:58 Shutting down InfluxReporter
Requests      [total, rate, throughput]         374995, 1250.00, 1249.97
Duration      [total, attack, wait]             5m0s, 5m0s, 7.79ms
Latencies     [min, mean, 50, 90, 95, 99, max]  1.169ms, 6.293ms, 6.345ms, 7.723ms, 8.252ms, 10.683ms, 123.728ms
Bytes In      [total, mean]                     14249810, 38.00
Bytes Out     [total, mean]                     8624885, 23.00
Success       [ratio]                           100.00%
Status Codes  [code:count]                      200:374995  
Error Set:
2025/10/20 02:47:58 SLA 1 failed. P95 latency is not in 100000000-110000000ms time range: 8.252089ms